app/models/event.rb

  def ensure_correct_day
    if self.start_date >= Date.today
      events = Event.where(event_venue_id: self.event_venue_id)
---
SELECT "events".* FROM "events" WHERE "events"."event_venue_id" = ?  [["event_venue_id", 18]]